In [2]:
import pandas as pd
from sklearn.model_selection import train_test_split
salary = pd.read_csv('../data/salary.csv')
salary.head()

,salary,exprior,yearsworked,yearsrank,market,degree,otherqual,position,male,Field,yearsabs
0,53000.0,0,0,0,1.17,1,0,1,1,3,0
1,58000.0,1,0,0,1.24,1,0,1,1,2,0
2,45500.0,0,0,0,1.21,1,0,1,1,3,2
3,35782.0,0,2,1,0.99,1,0,1,1,4,1
4,34731.0,0,2,2,0.91,1,0,1,1,4,1

In [3]:
salary.shape

(514, 11)

In [4]:
x_salary = salary.drop('salary', axis='columns')
x_salary.head()

,exprior,yearsworked,yearsrank,market,degree,otherqual,position,male,Field,yearsabs
0,0,0,0,1.17,1,0,1,1,3,0
1,1,0,0,1.24,1,0,1,1,2,0
2,0,0,0,1.21,1,0,1,1,3,2
3,0,2,1,0.99,1,0,1,1,4,1
4,0,2,2,0.91,1,0,1,1,4,1

In [5]:
y_salary = salary['salary']
y_salary.head()

0    53000.0
1    58000.0
2    45500.0
3    35782.0
4    34731.0
Name: salary, dtype: float64

In [6]:
x_salary_train, x_salary_test, y_salary_train, y_salary_test= train_test_split(x_salary,y_salary)

In [7]:
x_salary_train.head(10)

,exprior,yearsworked,yearsrank,market,degree,otherqual,position,male,Field,yearsabs
148,13,1,1,0.99,1,0,3,1,2,0
361,4,26,22,0.78,1,0,2,1,3,0
104,0,9,3,0.84,1,0,2,1,1,0
276,0,22,16,0.85,1,0,2,1,4,1
443,1,8,1,0.85,1,0,2,0,3,2
399,0,0,0,0.81,1,0,1,0,3,3
268,3,21,13,0.91,1,0,2,1,3,0
228,1,21,11,0.76,1,0,3,1,1,1
97,3,6,0,0.91,1,0,2,1,4,0
369,3,28,21,1.00,1,0,3,1,1,2

In [8]:
y_salary_train.head()

148    52054.24609
361    44319.00000
104    42563.00000
276    45287.00000
443    41563.00000
Name: salary, dtype: float64

In [9]:

x_salary_train.isnull().sum()

exprior        0
yearsworked    0
yearsrank      0
market         0
degree         0
otherqual      0
position       0
male           0
Field          0
yearsabs       0
dtype: int64

In [10]:
y_salary_train.isnull().sum()

1

In [13]:
x_salary_train= x_salary_train[(x_salary_train.yearsabs<5) & (x_salary_train.exprior<5)].head(11)

,exprior,yearsworked,yearsrank,market,degree,otherqual,position,male,Field,yearsabs
361,4,26,22,0.78,1,0,2,1,3,0
104,0,9,3,0.84,1,0,2,1,1,0
276,0,22,16,0.85,1,0,2,1,4,1
443,1,8,1,0.85,1,0,2,0,3,2
399,0,0,0,0.81,1,0,1,0,3,3
268,3,21,13,0.91,1,0,2,1,3,0
228,1,21,11,0.76,1,0,3,1,1,1
97,3,6,0,0.91,1,0,2,1,4,0
369,3,28,21,1.00,1,0,3,1,1,2
58,1,3,3,0.85,1,0,1,1,3,1
100,0,9,4,0.99,1,0,2,1,4,0